# CanHaveShape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewCropRegionShapeManager..::..CanHaveShape Property
ViewCropRegionShapeManager Class See Also
---
Verifies that the crop of the associated view is permitted to have a non-rectangular shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool CanHaveShape { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CanHaveShape As Boolean
	Get
```

Visual C++
---
```text
public:
property bool CanHaveShape {
	bool get ();
}
```

# See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace